capybara/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-F1ZNgpLtEt25cwI34nasA"], ["updated_at", "2018-11-17 00:13:38.207792"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = generate_session_token
    self.save!